#ifdef __MMI_SKYQQ__
#ifndef __SKY_QQ_OPEN_H__
#define __SKY_QQ_OPEN_H__

#include "mmk_type.h"


#define SPREADTRUM_MOD

#define sky_qq_log(a)     mr_printf a
#define DEBUG_PROTO(a)    mr_printf a

typedef  unsigned short     uint16;      /* Unsigned 16 bit value */
typedef  unsigned long int  uint32;      /* Unsigned 32 bit value */
typedef  long int  int32;      /* signed 32 bit value */
typedef  unsigned char        uint8;        /* Signed 8  bit value */
typedef  signed char        int8;        /* Signed 8  bit value */
typedef  signed short       int16;       /* Signed 16 bit value */

enum 
{
	QQ2008_STOP,
	QQ2008_RUN,
	QQ2008_PAUSE,
	QQ2008_BACK_RUN  /*后台运行*/
};

enum 
{
	QQ2008_HIDE_ICON,
	QQ2008_SHOW_ICON,
	QQ2008_BLINK_ICON
};

typedef enum 
{
	QQ2008_ONLINE_STATUS,
	QQ2008_AWAY_STATUS,
	QQ2008_OFFLINE_STATUS,
	QQ2008_HIDE_STATUS	
}QQ2008_STATE_E;

//QQ动态申请内存大小
//以下这个值可根据实际的需要进行配置，最少是90K，最好建议加开到120K，因为目前
//好友的总数有的帐号出现有870个好友的，这样的超级用户内存不足；
#define QQ2008_MEM_LEN (120*1024)

//后台重连的次数
#define QQ2008_AUTOLOGIN_TIMERS (10)
#define PURE_MEMORY

extern uint8 QQmin;

//extern int32 QQ2008KeyEventInto(int16 ktype ,int32 param1,int32 param2);
//数字键定义开关，如果有数字键就返回1，否则返回0。
int32 IsHaveNumKey(void);

//是否有中间键，五方向键的定义开关，如果是五方向键就返回1，否则返回0；
int32 IsHaveMidleKey(void);

//是否需要显示wifi这种联网方式的菜单；返回1就是显示菜单，否则就是不显示菜单。
int32 IsWIFIModle(void);

//好友上线后是否播放上线声音
//返回1   代表好友上线时需要播放声音，返回0就是不播放
int32 GetOnlineSoundPlayFlag(void);

//是否有振动的提示开关，返回1表示需要屏蔽振动菜单(当前的平台不支持振动)，
//否则就不需要屏蔽(即支持振动)；这里要反过来定义，是因为之前的版本没有这个开关，返回的默认是0；
int32 IsShieldVibrator(void);

//T卡是否存在判断；
int8 GetPathFree(void);
//T卡是否存在 的标志位；
int32 GetPathFreeFlag(void);

//创建QQ2009D 根目录
void QQ2008CreateRootDir(void);



 /*********************************************************************
函数名:QQ2008MINIShowIdle
功能说明:IDLE界面QQ头像的闪动模式处理，可以是
			  隐藏、闪动、静态显示
**********************************************************************/
void QQ2008MINIShowIdle(int8 flag);
 /*********************************************************************
函数名:StopIcon
功能说明:后台运行具体函数，并设置QQ的运行状态
				为后台运行模式
**********************************************************************/
void MINQQ(void);

 /*********************************************************************
函数名:StopIcon
功能说明:停止idle界面QQ头像的闪动，对头像进行隐藏
**********************************************************************/
void StopIcon(void);


 /*********************************************************************
函数名:GetSkyQQRunState
功能说明:获取QQ的当前状态，这里标示的是网络层的
			   状态，可以是
			   	QQ2008_STOP,
				QQ2008_RUN,
				QQ2008_PAUSE,
				QQ2008_BACK_RUN  后台运行
**********************************************************************/
int GetSkyQQRunState(void);
 /*********************************************************************
函数名:SetSkyQQRunState
功能说明:设置当前的QQ运行状态
			   	QQ2008_STOP,
				QQ2008_RUN,
				QQ2008_PAUSE,
				QQ2008_BACK_RUN 后台运行
**********************************************************************/
void SetSkyQQRunState(int state);

 /*********************************************************************
函数名:sky_qq_init
功能说明:对底层的模块进行初始化，主要是申请内存
			  和一些数据的初始赋值
**********************************************************************/
void sky_qq_init(void);

 /*********************************************************************
函数名:ActiveQQ2008Screen
功能说明:仅在qq是后台时可以使用它来激活qq界面
**********************************************************************/
void ActiveQQ2008Screen(void);

/*********************************************************************
函数名:SKYQQShowIdle
功能说明:在idle界面根据不同的QQ在线状态显示不同的icon
**********************************************************************/
void SKYQQShowIdle(int state);
/*********************************************************************
函数名:QQ2008Mem_malloc
功能说明:以下这个函数实现向多媒体申请内存，申请
 			  的大小是有QQ2008_MEM_LEN这个宏决定的
**********************************************************************/
extern void* QQ2008Mem_malloc(int32 size);
/*释放申请到的内存*/
/*********************************************************************
函数名:QQ2008Mem_free
功能说明:释放QQ2008Mem_malloc这个函数申请的内存
**********************************************************************/
extern void  QQ2008Mem_free(void * ptr);
/*********************************************************************
函数名:QQ2008MemoryMalloc
功能说明:以下这个函数供程序调用进行内存的分配
			  可以是QQ2008Mem_malloc申请也可以是静态内存
**********************************************************************/
extern void * QQ2008MemoryMalloc(void);
/*********************************************************************
函数名:GetQQ2008IconState
功能说明:QQ的当前在线状态
	QQ2008_ONLINE_STATUS,
	QQ2008_AWAY_STATUS,
	QQ2008_OFFLINE_STATUS,
	QQ2008_HIDE_STATUS	
			
**********************************************************************/
extern int GetQQ2008IconState(void);

/*********************************************************************
函数名:sky_qq_exit
功能说明:底层的网络层退出
**********************************************************************/
void sky_qq_exit(void);
/*********************************************************************
函数名:sky_qq_force_exit
功能说明:这个同时会退出dsm
**********************************************************************/
void sky_qq_force_exit(void);

/*********************************************************************
函数名:int32 GetMallocMemSize(void)
描  述:返回需要申请内存的大小
参  数:无
返  回:返回需要申请内存的大小
*********************************************************************/
int32 GetMallocMemSize(void);

/********************************************************************
函数名:int32 GetAutoConnectTimers(void)
描  述:返回重连次数的设置
参  数:无
返  回:返回重连次数的设置
********************************************************************/
int32 GetAutoConnectTimers(void);

/********************************************************************
函数名:void setRecvMsgFlag(int32 flag)
描  述:设置是否有未读消息的标志位
参  数:1代表有未读信息，0代表没有未读信息
返  回:无
********************************************************************/
void setRecvMsgFlag(int32 flag);

/********************************************************************
函数名:int32 getRecvMsgFlag(void)
描  述:返回是否有未读消息的标志
参  数:无
返  回: 1代表有未读信息
        0代表没有未读信息
********************************************************************/
int32 getRecvMsgFlag(void);

#endif 
#endif


